%***************************************************
%创建日期：2010.07.29
%功能描述：产生高斯白噪信号，取4096个点，将信号放大，
%转换成无符号数据，存入ROM中作为信号源
%****************************************************
clear all
clc
Y = wgn(4096, 1, 10, 'real');
nummax = max(Y);
y = Y/nummax;   %把信号限定在[-1,1]范围内，变为定点数据,将Y除以最大的那个数
y = y*32768; %将信号放大32768倍
b = signed2unsigned(y,16);  %转换为无符号数输入 
fid = fopen('noise.txt','wt'); %将信号写入一个.txt文件中
fprintf(fid,'%16.0f\n',b);
[xz,w] = freqz(y,1,512);      %求频率响应
figure(2);
plot(w/pi,20*log10(abs(xz))); %画出幅频响应
fclose(fid);